In [1]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [2]:
alunos.head(5)

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
1  Cátia     27    F    2.5     False
2  Denis     56    M    5.0     False
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True

In [3]:
alunos.query('Aprovado')

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [4]:
aprovados = alunos.query('Aprovado')

In [5]:
aprovados.head()

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [8]:
alunas_aprovadas = alunos.query('Sexo == "F" and Aprovado')

In [9]:
alunas_aprovadas

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [25]:
alunos_entre_10_e_20_anos = alunos[alunos.Idade.isin(range(10, 20))]

In [26]:
alunos_maior_que_40_anos = alunos.query('Idade >= 40')

In [27]:
alunos_entre_10_e_20_anos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False

In [28]:
alunos_maior_que_40_anos

    Nome  Idade Sexo  Notas  Aprovado
2  Denis     56    M    5.0     False
4  Bruna     42    F    8.2      True

In [32]:
alunos_entre_10_e_20_anos_ou_maior_que_40_anos = alunos_entre_10_e_20_anos.combine_first(alunos_maior_que_40_anos)

In [35]:
alunos_entre_10_e_20_anos_ou_maior_que_40_anos

     Nome  Idade Sexo  Notas Aprovado
0     Ary   15.0    M    7.5     True
2   Denis   56.0    M    5.0    False
4   Bruna   42.0    F    8.2     True
6  Carlos   19.0    M    6.0    False

In [36]:
alunos_reprovados = alunos.query('not Aprovado')

In [50]:
alunos_reprovados[['Nome', 'Sexo', 'Idade']]

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [52]:
alunos.sort_values(by='Idade')[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True